<%@ page contentType="text/html; charset=UTF-8" language="java" trimDirectiveWhitespaces="true" %>

<%@ taglib prefix="spring" uri="http://www.springframework.org/tags" %>
<%@ taglib prefix="uengine" uri="http://www.uengine.io/tags" %>
최종 수정 날짜: 2015년 6월 30일

uengine에 오신 것을 환영합니다.

uengine 제품을 이용해 주셔서 감사합니다. 제품는 Hokyoung 2F, 122-30, Samsung-dong, Gangnam-gu, Seoul, Korea에 소재한 uengine Inc.(‘uengine’)에서 제공합니다.

제품을 이용함으로써 귀하는 본 약관에 동의하게 되므로 본 약관을 주의 깊게 읽어보시기 바랍니다.

uengine의 제품는 매우 다양하므로 때로 추가약관 또는 제품 요구사항(연령 요건 포함)이 적용될 수 있습니다. 추가약관은 관련 기능에 대하여 제공되며, 귀하가 해당 기능을 이용하는 경우 이 추가약관은 귀하와 uengine 간 계약의 일부가 됩니다.

uengine 제품 이용

귀하는 제품 내에서 적용되는 모든 정책을 준수해야 합니다.

uengine 제품의 오용을 삼가시기 바랍니다. 예를 들어 uengine의 제품을 허가 없이 판매 및 양도하거나, 바이너리를 decompile 및 안내사항 이외의 다른 방법으로 사용 및 액세스를 시도하지 않아야 합니다.

귀하는 관련 수출 및 재수출 통제 법규 및 규정 등 오직 법률상 허용되는 범위에서만 uengine의 제품을 이용할 수 있습니다.

귀하가 uengine의 약관이나 정책을 준수하지 않거나 uengine이 부정행위 혐의를 조사하고 있는 경우, uengine의 제품 제공이 일시 중지 또는 중단될 수 있습니다.

uengine의 제품을 사용한다고 해서 uengine의 제품을 소유하게 되는 것은 아닙니다.

본 약관은 귀하에게 uengine의 제품에 사용된 브랜드나 로고를 사용할 권리를 부여하지 않습니다. uengine 제품에 또는 uengine 제품와 함께 게재된 어떠한 법적 고지도 삭제하거나 감추거나 변경하지 마십시오.

제품 이용과 관련하여 uengine은 귀하에게 고지, 관리 메시지 및 기타 정보를 발송할 수 있습니다. 귀하는 메시지 수신을 거부할 수 있습니다.

uengine의 보증 및 부인

본 약관 또는 추가약관에 명시되지 않은 한 uengine, 또는 제품의 공급자나 판매자는 제품과 관련하여 어떠한 구체적인 약정도 하지 않습니다.

Google 서비스에 대한 책임

법률상 허용되는 경우, uengine, 제품의 공급자 및 판매자는 손실 및 손해에 대해 책임지지 않습니다.

법률상 허용되는 한도 내에서, 묵시적 보증을 포함하여 본 약관에 따른 청구에 대한 uengine, 제품의 공급자 및 판매자의 총 책임은 귀하가 제품 사용을 위해 uengine에 지급한 금원(또는 uengine의 선택에 따라 귀하에게 제품을 다시 제공하는 것)으로 제한됩니다.

어떤 경우에도 uengine, 제품의 공급자 및 판매자는 합리적으로 예측 불가능한 손실이나 손해에 대해 책임지지 않습니다.

본 약관에 대하여

uengine은 법률의 변경이나 제품의 변경사항을 반영하기 위한 목적 등으로 본 약관이나 제품에 적용되는 추가약관을 수정할 수 있습니다. 귀하는 정기적으로 약관을 확인해야 합니다. 본 페이지의 약관이 변경되는 경우 uengine은 이에 대한 공지를 게시합니다. uengine은 추가약관의 변경 공지를 홈페이지에 게재할 것입니다. 당해 변경은 소급되어 적용되지 않으며 게시하고 14일 이후에 발효됩니다. 단, 제품에 대한 새로운 기능과 관련된 변경이나 법률적인 사유로 인한 변경은 즉시 발효됩니다. 제품에 대해 변경된 약관에 동의하지 않는 경우 해당 제품의 사용을 중지해야 합니다.

본 약관과 추가약관이 상충하는 경우, 상충하는 사항에 대하여 추가약관이 적용됩니다.

본 약관은 uengine과 귀하와의 관계를 규율하며, 어떠한 제3자의 수익권도 발생시키지 않습니다.

귀하가 본 약관을 준수하지 않은 경우, 당사가 즉시 조치를 취하지 않더라도 이는 당사가 가지고 있는 권리(향후 조치를 취하는 것 등)를 포기함을 의미하지 않습니다.

특정 조항이 집행 불가능한 것으로 판명되는 경우, 이는 다른 조항에 영향을 미치지 않습니다.

uengine에 문의하는 방법을 보려면 문의 페이지(http://www.uengine.io/contact)를 참조하시기 바랍니다.
